betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_irda.c
/**
  *
  * @file    apm32f4xx_dal_irda.c
  * @brief   IRDA DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the IrDA SIR ENDEC block (IrDA):
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
    The IRDA DAL driver can be used as follows:

    (#) Declare a IRDA_HandleTypeDef handle structure (eg. IRDA_HandleTypeDef hirda).
    (#) Initialize the IRDA low level resources by implementing the DAL_IRDA_MspInit() API:
        (##) Enable the USARTx interface clock.
        (##) IRDA pins configuration:
            (+++) Enable the clock for the IRDA GPIOs.
            (+++) Configure IRDA pins as alternate function pull-up.
        (##) NVIC configuration if you need to use interrupt process (DAL_IRDA_Transmit_IT()
             and DAL_IRDA_Receive_IT() APIs):
            (+++) Configure the USARTx interrupt priority.
            (+++) Enable the NVIC USART IRQ handle.
        (##) DMA Configuration if you need to use DMA process (DAL_IRDA_Transmit_DMA()
             and DAL_IRDA_Receive_DMA() APIs):
            (+++) Declare a DMA handle structure for the Tx/Rx stream.
            (+++) Enable the DMAx interface clock.
            (+++) Configure the declared DMA handle structure with the required Tx/Rx parameters.
            (+++) Configure the DMA Tx/Rx stream.
            (+++) Associate the initialized DMA handle to the IRDA DMA Tx/Rx handle.
            (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA Tx/Rx stream.
            (+++) Configure the IRDAx interrupt priority and enable the NVIC USART IRQ handle
                  (used for last byte sending completion detection in DMA non circular mode)

    (#) Program the Baud Rate, Word Length, Parity, IrDA Mode, Prescaler
        and Mode(Receiver/Transmitter) in the hirda Init structure.

    (#) Initialize the IRDA registers by calling the DAL_IRDA_Init() API:
        (++) This API configures also the low level Hardware GPIO, CLOCK, CORTEX...etc)
             by calling the customized DAL_IRDA_MspInit() API.

         -@@- The specific IRDA interrupts (Transmission complete interrupt,
             RXNE interrupt and Error Interrupts) will be managed using the macros
             __DAL_IRDA_ENABLE_IT() and __DAL_IRDA_DISABLE_IT() inside the transmit and receive process.

    (#) Three operation modes are available within this driver :

    *** Polling mode IO operation ***
    =================================
    [..]
      (+) Send an amount of data in blocking mode using DAL_IRDA_Transmit()
      (+) Receive an amount of data in blocking mode using DAL_IRDA_Receive()

    *** Interrupt mode IO operation ***
    ===================================
    [..]
      (+) Send an amount of data in non blocking mode using DAL_IRDA_Transmit_IT()
      (+) At transmission end of transfer DAL_IRDA_TxCpltCallback is executed and user can
           add his own code by customization of function pointer DAL_IRDA_TxCpltCallback
      (+) Receive an amount of data in non blocking mode using DAL_IRDA_Receive_IT()
      (+) At reception end of transfer DAL_IRDA_RxCpltCallback is executed and user can
           add his own code by customization of function pointer DAL_IRDA_RxCpltCallback
      (+) In case of transfer Error, DAL_IRDA_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_IRDA_ErrorCallback

    *** DMA mode IO operation ***
    =============================
    [..]
      (+) Send an amount of data in non blocking mode (DMA) using DAL_IRDA_Transmit_DMA()
      (+) At transmission end of half transfer DAL_IRDA_TxHalfCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_IRDA_TxHalfCpltCallback
      (+) At transmission end of transfer DAL_IRDA_TxCpltCallback is executed and user can
           add his own code by customization of function pointer DAL_IRDA_TxCpltCallback
      (+) Receive an amount of data in non blocking mode (DMA) using DAL_IRDA_Receive_DMA()
      (+) At reception end of half transfer DAL_IRDA_RxHalfCpltCallback is executed and user can
            add his own code by customization of function pointer DAL_IRDA_RxHalfCpltCallback
      (+) At reception end of transfer DAL_IRDA_RxCpltCallback is executed and user can
           add his own code by customization of function pointer DAL_IRDA_RxCpltCallback
      (+) In case of transfer Error, DAL_IRDA_ErrorCallback() function is executed and user can
           add his own code by customization of function pointer DAL_IRDA_ErrorCallback
      (+) Pause the DMA Transfer using DAL_IRDA_DMAPause()
      (+) Resume the DMA Transfer using DAL_IRDA_DMAResume()
      (+) Stop the DMA Transfer using DAL_IRDA_DMAStop()

    *** IRDA DAL driver macros list ***
    ===================================
    [..]
      Below the list of most used macros in IRDA DAL driver.

       (+) __DAL_IRDA_ENABLE: Enable the IRDA peripheral
       (+) __DAL_IRDA_DISABLE: Disable the IRDA peripheral
       (+) __DAL_IRDA_GET_FLAG : Check whether the specified IRDA flag is set or not
       (+) __DAL_IRDA_CLEAR_FLAG : Clear the specified IRDA pending flag
       (+) __DAL_IRDA_ENABLE_IT: Enable the specified IRDA interrupt
       (+) __DAL_IRDA_DISABLE_IT: Disable the specified IRDA interrupt
       (+) __DAL_IRDA_GET_IT_SOURCE: Check whether the specified IRDA interrupt has occurred or not

