betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_irda.c
  return status;
}

/**
  * @brief  Unregister an IRDA callback
  *         IRDA callback is redirected to the weak predefined callback
  * @param  hirda irda handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_IRDA_TX_HALFCOMPLETE_CB_ID Tx Half Complete Callback ID
  *           @arg @ref DAL_IRDA_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_IRDA_RX_HALFCOMPLETE_CB_ID Rx Half Complete Callback ID
  *           @arg @ref DAL_IRDA_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_IRDA_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_IRDA_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_IRDA_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref DAL_IRDA_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref DAL_IRDA_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_IRDA_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_IRDA_UnRegisterCallback(IRDA_HandleTypeDef *hirda, DAL_IRDA_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hirda);

  if (DAL_IRDA_STATE_READY == hirda->gState)
  {
    switch (CallbackID)
    {
      case DAL_IRDA_TX_HALFCOMPLETE_CB_ID :
        hirda->TxHalfCpltCallback = DAL_IRDA_TxHalfCpltCallback;               /* Legacy weak  TxHalfCpltCallback       */
        break;

      case DAL_IRDA_TX_COMPLETE_CB_ID :
        hirda->TxCpltCallback = DAL_IRDA_TxCpltCallback;                       /* Legacy weak TxCpltCallback            */
        break;

      case DAL_IRDA_RX_HALFCOMPLETE_CB_ID :
        hirda->RxHalfCpltCallback = DAL_IRDA_RxHalfCpltCallback;               /* Legacy weak RxHalfCpltCallback        */
        break;

      case DAL_IRDA_RX_COMPLETE_CB_ID :
        hirda->RxCpltCallback = DAL_IRDA_RxCpltCallback;                       /* Legacy weak RxCpltCallback            */
        break;

      case DAL_IRDA_ERROR_CB_ID :
        hirda->ErrorCallback = DAL_IRDA_ErrorCallback;                         /* Legacy weak ErrorCallback             */
        break;

      case DAL_IRDA_ABORT_COMPLETE_CB_ID :
        hirda->AbortCpltCallback = DAL_IRDA_AbortCpltCallback;                 /* Legacy weak AbortCpltCallback         */
        break;

      case DAL_IRDA_ABORT_TRANSMIT_COMPLETE_CB_ID :
        hirda->AbortTransmitCpltCallback = DAL_IRDA_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
        break;

      case DAL_IRDA_ABORT_RECEIVE_COMPLETE_CB_ID :
        hirda->AbortReceiveCpltCallback = DAL_IRDA_AbortReceiveCpltCallback;   /* Legacy weak AbortReceiveCpltCallback  */
        break;

      case DAL_IRDA_MSPINIT_CB_ID :
        hirda->MspInitCallback = DAL_IRDA_MspInit;                             /* Legacy weak MspInitCallback           */
        break;

      case DAL_IRDA_MSPDEINIT_CB_ID :
        hirda->MspDeInitCallback = DAL_IRDA_MspDeInit;                         /* Legacy weak MspDeInitCallback         */
        break;

      default :
        /* Update the error code */
        hirda->ErrorCode |= DAL_IRDA_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_IRDA_STATE_RESET == hirda->gState)
  {
    switch (CallbackID)
    {
      case DAL_IRDA_MSPINIT_CB_ID :
        hirda->MspInitCallback = DAL_IRDA_MspInit;
        break;

      case DAL_IRDA_MSPDEINIT_CB_ID :
        hirda->MspDeInitCallback = DAL_IRDA_MspDeInit;
        break;

      default :
        /* Update the error code */
        hirda->ErrorCode |= DAL_IRDA_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hirda->ErrorCode |= DAL_IRDA_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hirda);

  return status;
}
#endif /* USE_DAL_IRDA_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup IRDA_Exported_Functions_Group2 IO operation functions
  *  @brief   IRDA Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
  ==============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the IRDA data transfers.
    IrDA is a half duplex communication protocol. If the Transmitter is busy, any data
    on the IrDA receive line will be ignored by the IrDA decoder and if the Receiver
    is busy, data on the TX from the USART to IrDA will not be encoded by IrDA.
    While receiving data, transmission should be avoided as the data to be transmitted
    could be corrupted.

    (#) There are two modes of transfer:
       (++) Blocking mode: The communication is performed in polling mode.
            The DAL status of all data processing is returned by the same function
            after finishing transfer.
       (++) Non-Blocking mode: The communication is performed using Interrupts
           or DMA, these API's return the DAL status.
           The end of the data processing will be indicated through the
           dedicated IRDA IRQ when using Interrupt mode or the DMA IRQ when
           using DMA mode.
           The DAL_IRDA_TxCpltCallback(), DAL_IRDA_RxCpltCallback() user callbacks
           will be executed respectively at the end of the Transmit or Receive process
           The DAL_IRDA_ErrorCallback() user callback will be executed when a communication error is detected

    (#) Blocking mode APIs are :
        (++) DAL_IRDA_Transmit()
        (++) DAL_IRDA_Receive()

    (#) Non Blocking mode APIs with Interrupt are :
        (++) DAL_IRDA_Transmit_IT()
        (++) DAL_IRDA_Receive_IT()
        (++) DAL_IRDA_IRQHandler()

    (#) Non Blocking mode functions with DMA are :
        (++) DAL_IRDA_Transmit_DMA()
        (++) DAL_IRDA_Receive_DMA()
        (++) DAL_IRDA_DMAPause()
        (++) DAL_IRDA_DMAResume()
        (++) DAL_IRDA_DMAStop()

    (#) A set of Transfer Complete Callbacks are provided in Non Blocking mode:
        (++) DAL_IRDA_TxHalfCpltCallback()
        (++) DAL_IRDA_TxCpltCallback()
        (++) DAL_IRDA_RxHalfCpltCallback()
        (++) DAL_IRDA_RxCpltCallback()
        (++) DAL_IRDA_ErrorCallback()

    (#) Non-Blocking mode transfers could be aborted using Abort API's :
        (+) DAL_IRDA_Abort()
        (+) DAL_IRDA_AbortTransmit()
        (+) DAL_IRDA_AbortReceive()
        (+) DAL_IRDA_Abort_IT()
        (+) DAL_IRDA_AbortTransmit_IT()
        (+) DAL_IRDA_AbortReceive_IT()

    (#) For Abort services based on interrupts (DAL_IRDA_Abortxxx_IT), a set of Abort Complete Callbacks are provided:
        (+) DAL_IRDA_AbortCpltCallback()
        (+) DAL_IRDA_AbortTransmitCpltCallback()
        (+) DAL_IRDA_AbortReceiveCpltCallback()

