betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_irda.c
    /* Enable the IRDA Error Interrupt: (Frame error, Noise error, Overrun error) */
    SET_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit
    in the USART CTRL3 register */
    SET_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief Pauses the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_IRDA_DMAPause(IRDA_HandleTypeDef *hirda)
{
  uint32_t dmarequest = 0x00U;

  /* Process Locked */
  __DAL_LOCK(hirda);

  dmarequest = DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);
  if ((hirda->gState == DAL_IRDA_STATE_BUSY_TX) && dmarequest)
  {
    /* Disable the IRDA DMA Tx request */
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);
  }

  dmarequest = DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);
  if ((hirda->RxState == DAL_IRDA_STATE_BUSY_RX) && dmarequest)
  {
    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hirda->Instance->CTRL1, USART_CTRL1_PEIEN);
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Disable the IRDA DMA Rx request */
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);
  }

  /* Process Unlocked */
  __DAL_UNLOCK(hirda);

  return DAL_OK;
}

/**
  * @brief Resumes the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_IRDA_DMAResume(IRDA_HandleTypeDef *hirda)
{
  /* Process Locked */
  __DAL_LOCK(hirda);

  if (hirda->gState == DAL_IRDA_STATE_BUSY_TX)
  {
    /* Enable the IRDA DMA Tx request */
    SET_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);
  }

  if (hirda->RxState == DAL_IRDA_STATE_BUSY_RX)
  {
    /* Clear the Overrun flag before resuming the Rx transfer */
    __DAL_IRDA_CLEAR_OREFLAG(hirda);

    /* Re-enable PE and ERR (Frame error, noise error, overrun error) interrupts */
    if (hirda->Init.Parity != IRDA_PARITY_NONE)
    {    
      SET_BIT(hirda->Instance->CTRL1, USART_CTRL1_PEIEN);
    }
    SET_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

    /* Enable the IRDA DMA Rx request */
    SET_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);
  }

  /* Process Unlocked */
  __DAL_UNLOCK(hirda);

  return DAL_OK;
}

/**
  * @brief Stops the DMA Transfer.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_IRDA_DMAStop(IRDA_HandleTypeDef *hirda)
{
  uint32_t dmarequest = 0x00U;
  /* The Lock is not implemented on this API to allow the user application
     to call the DAL IRDA API under callbacks DAL_IRDA_TxCpltCallback() / DAL_IRDA_RxCpltCallback():
     when calling DAL_DMA_Abort() API the DMA TX/RX Transfer complete interrupt is generated
     and the correspond call back is executed DAL_IRDA_TxCpltCallback() / DAL_IRDA_RxCpltCallback()
  */

  /* Stop IRDA DMA Tx request if ongoing */
  dmarequest = DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);
  if ((hirda->gState == DAL_IRDA_STATE_BUSY_TX) && dmarequest)
  {
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);

    /* Abort the IRDA DMA Tx channel */
    if (hirda->hdmatx != NULL)
    {
      DAL_DMA_Abort(hirda->hdmatx);
    }
    IRDA_EndTxTransfer(hirda);
  }

  /* Stop IRDA DMA Rx request if ongoing */
  dmarequest = DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);
  if ((hirda->RxState == DAL_IRDA_STATE_BUSY_RX) && dmarequest)
  {
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);

    /* Abort the IRDA DMA Rx channel */
    if (hirda->hdmarx != NULL)
    {
      DAL_DMA_Abort(hirda->hdmarx);
    }
    IRDA_EndRxTransfer(hirda);
  }

  return DAL_OK;
}

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  hirda IRDA handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable PPP Interrupts
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling DAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval DAL status
*/
DAL_StatusTypeDef DAL_IRDA_Abort(IRDA_HandleTypeDef *hirda)
{
  /* Disable TXEIE, TCIE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hirda->Instance->CTRL1, (USART_CTRL1_RXBNEIEN | USART_CTRL1_PEIEN | USART_CTRL1_TXBEIEN | USART_CTRL1_TXCIEN));
  CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

  /* Disable the IRDA DMA Tx request if enabled */
  if (DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN))
  {
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMATXEN);

    /* Abort the IRDA DMA Tx channel : use blocking DMA Abort API (no callback) */
    if (hirda->hdmatx != NULL)
    {
      /* Set the IRDA DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hirda->hdmatx->XferAbortCallback = NULL;

      DAL_DMA_Abort(hirda->hdmatx);
    }
  }

  /* Disable the IRDA DMA Rx request if enabled */
  if (DAL_IS_BIT_SET(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN))
  {
    CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_DMARXEN);

    /* Abort the IRDA DMA Rx channel : use blocking DMA Abort API (no callback) */
    if (hirda->hdmarx != NULL)
    {
      /* Set the IRDA DMA Abort callback to Null.
         No call back execution at end of DMA abort procedure */
      hirda->hdmarx->XferAbortCallback = NULL;

