betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_irda.c
  hirda->TxXferCount = 0x00U;

  /* Restore hirda->gState to Ready */
  hirda->gState = DAL_IRDA_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_DAL_IRDA_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Transmit Complete Callback */
  hirda->AbortTransmitCpltCallback(hirda);
#else
  /* Call legacy weak Abort Transmit Complete Callback */
  DAL_IRDA_AbortTransmitCpltCallback(hirda);
#endif /* USE_DAL_IRDA_REGISTER_CALLBACK */
}

/**
  * @brief  DMA IRDA Rx communication abort callback, when initiated by user by a call to
  *         DAL_IRDA_AbortReceive_IT API (Abort only Rx transfer)
  *         (This callback is executed at end of DMA Rx Abort procedure following user abort request,
  *         and leads to user Rx Abort Complete callback execution).
  * @param  hdma DMA handle.
  * @retval None
  */
static void IRDA_DMARxOnlyAbortCallback(DMA_HandleTypeDef *hdma)
{
  IRDA_HandleTypeDef *hirda = (IRDA_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  hirda->RxXferCount = 0x00U;

  /* Restore hirda->RxState to Ready */
  hirda->RxState = DAL_IRDA_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_DAL_IRDA_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Receive Complete Callback */
  hirda->AbortReceiveCpltCallback(hirda);
#else
  /* Call legacy weak Abort Receive Complete Callback */
  DAL_IRDA_AbortReceiveCpltCallback(hirda);
#endif /* USE_DAL_IRDA_REGISTER_CALLBACK */
}

/**
 * @brief  Send an amount of data in non blocking mode.
 * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
 *                the configuration information for the specified IRDA module.
 * @retval DAL status
 */
static DAL_StatusTypeDef IRDA_Transmit_IT(IRDA_HandleTypeDef *hirda)
{
  const uint16_t *tmp;

  /* Check that a Tx process is ongoing */
  if (hirda->gState == DAL_IRDA_STATE_BUSY_TX)
  {
    if (hirda->Init.WordLength == IRDA_WORDLENGTH_9B)
    {
      tmp = (const uint16_t *) hirda->pTxBuffPtr;
      hirda->Instance->DATA = (uint16_t)(*tmp & (uint16_t)0x01FF);
      if (hirda->Init.Parity == IRDA_PARITY_NONE)
      {
        hirda->pTxBuffPtr += 2U;
      }
      else
      {
        hirda->pTxBuffPtr += 1U;
      }
    }
    else
    {
      hirda->Instance->DATA = (uint8_t)(*hirda->pTxBuffPtr++ & (uint8_t)0x00FF);
    }

    if (--hirda->TxXferCount == 0U)
    {
      /* Disable the IRDA Transmit Data Register Empty Interrupt */
      CLEAR_BIT(hirda->Instance->CTRL1, USART_CTRL1_TXBEIEN);

      /* Enable the IRDA Transmit Complete Interrupt */
      SET_BIT(hirda->Instance->CTRL1, USART_CTRL1_TXCIEN);
    }

    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval DAL status
  */
static DAL_StatusTypeDef IRDA_EndTransmit_IT(IRDA_HandleTypeDef *hirda)
{
  /* Disable the IRDA Transmit Complete Interrupt */
  CLEAR_BIT(hirda->Instance->CTRL1, USART_CTRL1_TXCIEN);

  /* Disable the IRDA Error Interrupt: (Frame error, noise error, overrun error) */
  CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

  /* Tx process is ended, restore hirda->gState to Ready */
  hirda->gState = DAL_IRDA_STATE_READY;

#if (USE_DAL_IRDA_REGISTER_CALLBACKS == 1)
  /* Call registered Tx complete callback */
  hirda->TxCpltCallback(hirda);
#else
  /* Call legacy weak Tx complete callback */
  DAL_IRDA_TxCpltCallback(hirda);
#endif /* USE_DAL_IRDA_REGISTER_CALLBACK */

  return DAL_OK;
}

/**
  * @brief  Receives an amount of data in non blocking mode.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval DAL status
  */
static DAL_StatusTypeDef IRDA_Receive_IT(IRDA_HandleTypeDef *hirda)
{
  uint16_t *tmp;
  uint16_t  uhdata;

  /* Check that a Rx process is ongoing */
  if (hirda->RxState == DAL_IRDA_STATE_BUSY_RX)
  {
    uhdata = (uint16_t) READ_REG(hirda->Instance->DATA);
    if (hirda->Init.WordLength == IRDA_WORDLENGTH_9B)
    {
      tmp = (uint16_t *) hirda->pRxBuffPtr;
      if (hirda->Init.Parity == IRDA_PARITY_NONE)
      {
        *tmp = (uint16_t)(uhdata & (uint16_t)0x01FF);
        hirda->pRxBuffPtr += 2U;
      }
      else
      {
        *tmp = (uint16_t)(uhdata & (uint16_t)0x00FF);
        hirda->pRxBuffPtr += 1U;
      }
    }
    else
    {
      if (hirda->Init.Parity == IRDA_PARITY_NONE)
      {
        *hirda->pRxBuffPtr++ = (uint8_t)(uhdata & (uint8_t)0x00FF);
      }
      else
      {
        *hirda->pRxBuffPtr++ = (uint8_t)(uhdata & (uint8_t)0x007F);
      }
    }

    if (--hirda->RxXferCount == 0U)
    {
      /* Disable the IRDA Data Register not empty Interrupt */
      CLEAR_BIT(hirda->Instance->CTRL1, USART_CTRL1_RXBNEIEN);

      /* Disable the IRDA Parity Error Interrupt */
      CLEAR_BIT(hirda->Instance->CTRL1, USART_CTRL1_PEIEN);

      /* Disable the IRDA Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(hirda->Instance->CTRL3, USART_CTRL3_ERRIEN);

      /* Rx process is completed, restore hirda->RxState to Ready */
      hirda->RxState = DAL_IRDA_STATE_READY;

#if (USE_DAL_IRDA_REGISTER_CALLBACKS == 1)
      /* Call registered Rx complete callback */
      hirda->RxCpltCallback(hirda);
#else
      /* Call legacy weak Rx complete callback */
      DAL_IRDA_RxCpltCallback(hirda);
#endif /* USE_DAL_IRDA_REGISTER_CALLBACKS */

      return DAL_OK;
    }
    return DAL_OK;
  }
  else
  {
    return DAL_BUSY;
  }
}

/**
  * @brief  Configures the IRDA peripheral.
  * @param  hirda  Pointer to a IRDA_HandleTypeDef structure that contains
  *                the configuration information for the specified IRDA module.
  * @retval None
  */
static void IRDA_SetConfig(IRDA_HandleTypeDef *hirda)
{
  uint32_t pclk;

  /* Check the parameters */
  ASSERT_PARAM(IS_IRDA_INSTANCE(hirda->Instance));
  ASSERT_PARAM(IS_IRDA_BAUDRATE(hirda->Init.BaudRate));
  ASSERT_PARAM(IS_IRDA_WORD_LENGTH(hirda->Init.WordLength));
  ASSERT_PARAM(IS_IRDA_PARITY(hirda->Init.Parity));
  ASSERT_PARAM(IS_IRDA_MODE(hirda->Init.Mode));
  ASSERT_PARAM(IS_IRDA_POWERMODE(hirda->Init.IrDAMode));

  /*-------------------------- USART CTRL2 Configuration ------------------------*/
  /* Clear STOP[13:12] bits */
  CLEAR_BIT(hirda->Instance->CTRL2, USART_CTRL2_STOPCFG);

  /*-------------------------- USART CTRL1 Configuration -----------------------*/
  /* Clear M, PCE, PS, TE and RE bits */
  CLEAR_BIT(hirda->Instance->CTRL1, (USART_CTRL1_DBLCFG | USART_CTRL1_PCEN | USART_CTRL1_PCFG | USART_CTRL1_TXEN | USART_CTRL1_RXEN));

  /* Configure the USART Word Length, Parity and mode:
     Set the M bits according to hirda->Init.WordLength value
     Set PCE and PS bits according to hirda->Init.Parity value
     Set TE and RE bits according to hirda->Init.Mode value */
  /* Write to USART CTRL1 */
  SET_BIT(hirda->Instance->CTRL1, (hirda->Init.WordLength | hirda->Init.Parity | hirda->Init.Mode));

  /*-------------------------- USART CTRL3 Configuration -----------------------*/
  /* Clear CTSE and RTSE bits */
  CLEAR_BIT(hirda->Instance->CTRL3, (USART_CTRL3_RTSEN | USART_CTRL3_CTSEN));

  /*-------------------------- USART BR Configuration -----------------------*/
#if defined(USART6) && defined(UART9) && defined(UART10)
   if ((hirda->Instance == USART1) || (hirda->Instance == USART6) || (hirda->Instance == UART9) || (hirda->Instance == UART10))
   {
    pclk = DAL_RCM_GetPCLK2Freq();
    SET_BIT(hirda->Instance->BR, IRDA_BR(pclk, hirda->Init.BaudRate));
   }
#elif defined(USART6)
  if((hirda->Instance == USART1) || (hirda->Instance == USART6))
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    SET_BIT(hirda->Instance->BR, IRDA_BR(pclk, hirda->Init.BaudRate));
  }
#else
  if(hirda->Instance == USART1)
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    SET_BIT(hirda->Instance->BR, IRDA_BR(pclk, hirda->Init.BaudRate));
  }
#endif /* USART6 */
  else
  {
    pclk = DAL_RCM_GetPCLK1Freq();
    SET_BIT(hirda->Instance->BR, IRDA_BR(pclk, hirda->Init.BaudRate));
  }
}

/**
  * @}
  */

#endif /* DAL_IRDA_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

